Revit 2026 API

# AdvancedWoodWoodRingThickness Property

---

The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodRingThickness { get; }
```
```vb
Public Shared ReadOnly Property WoodRingThickness As String
	Get
```
```cpp
public:
static property String^ WoodRingThickness {
	String^ get ();
}
```
```fsharp
static member WoodRingThickness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace